day4/first_app/app/controllers/posts_controller.rb

INSERT INTO `posts` (`category_id`, `created_at`, `updated_at`, `content`) VALUES(1, '2014-12-07 06:53:41', '2014-12-07 06:53:41', 'aaaa')
---
  def create
	@post = Post.new(params[:post])
	respond_to do |f|
		if @post.save

SELECT * FROM `posts` WHERE (`posts`.`id` = 3)
SELECT `posts`.* FROM `posts` INNER JOIN `comments` ON comments.post_id = posts.id INNER JOIN `guests` ON `guests`.id = `comments`.guest_id
---
  def show
	@post = Post.find(params[:id])
    #joins
    Post.all :joins => { :comments => :guest}